guixf/xiaozhi-esp32-inksight/main/boards/waveshare/esp32s3-r8n16-uc8176-4.2/esp32s3-r8n16-uc8176-4.2.cc
#include <driver/i2c_master.h>
#include <driver/spi_common.h>
#include <esp_log.h>
#include <esp_wifi.h>
#include <stdio.h>
#include "application.h"
#include "button.h"
#include "codecs/es8311_audio_codec.h"
#include "config.h"
#include "mcp_server.h"
#include "settings.h"
#include "uc8176_display.h"
#include "wifi_board.h"
#include "wifi_manager.h"
#include "assets/lang_config.h"

#include <esp_adc/adc_oneshot.h>
#include <esp_adc/adc_cali.h>
#include <esp_adc/adc_cali_scheme.h>
#include <esp_timer.h>
#include <esp_sleep.h>
#include <driver/rtc_io.h>
#include <nvs_flash.h>

#define TAG "esp32s3_r8n16_uc8176_42"
#define BATTERY_ADC_CHANNEL ADC_CHANNEL_2
#define BATTERY_ADC_ATTEN ADC_ATTEN_DB_12
#define BOOT_BUTTON_HOLD_MS 10000
#define DISPLAY_REFRESH_INTERVAL_US ((uint64_t)60 * 60 * 1000 * 1000)

// NVS键名定义
#define NVS_WAKEUP_NAMESPACE "wakeup"
#define NVS_KEY_BUTTON_FLAG "btn_wake"
#define NVS_KEY_TIMER_FLAG "timer_wake"
#define NVS_KEY_MARKER "marker"

#define WAKEUP_MARKER_VALID 0x5AA5
#define WAKEUP_MARKER_INVALID 0x0000

class Esp32s3r8n16Uc817642 : public WifiBoard {
private:
    i2c_master_bus_handle_t i2c_bus_;
    Button boot_button_;
    Button ai_button_;
    Button volume_up_button_;
    Button volume_down_button_;
    Uc8176Display* display_;
    adc_oneshot_unit_handle_t adc1_handle_;
    adc_cali_handle_t adc1_cali_handle_;
    bool adc_calibrated_;
    esp_timer_handle_t battery_timer_;
    esp_timer_handle_t refresh_timer_;
    esp_timer_handle_t heartbeat_timer_;
    esp_timer_handle_t live_mode_timer_;
    int last_battery_voltage_;
    int last_battery_percentage_;
    uint64_t last_refresh_time_;
    bool wifi_connected_;
    bool in_deep_sleep_;
    bool wakeup_fetch_done_;  // 标记唤醒后是否已获取图片
    bool wakeup_start_chat_;  // 标记唤醒后是否需要启动对话
    bool delayed_wakeup_;     // 标记是否需要延迟唤醒处理
    NetworkEventCallback saved_network_callback_;

    static void BatteryTimerCallback(void* arg) {
        Esp32s3r8n16Uc817642* board = static_cast<Esp32s3r8n16Uc817642*>(arg);
        board->display_->ProcessDisplayUpdate();
    }

    static void RefreshTimerCallback(void* arg) {
        Esp32s3r8n16Uc817642* board = static_cast<Esp32s3r8n16Uc817642*>(arg);
        board->ScheduleDisplayRefresh();
    }

    static void HeartbeatTimerCallback(void* arg) {
        Esp32s3r8n16Uc817642* board = static_cast<Esp32s3r8n16Uc817642*>(arg);
        ESP_LOGI(TAG, "[BATTERY] Reading battery voltage before heartbeat timer...");
        board->UpdateBatteryStatus();
        board->display_->SendHeartbeat();
    }

    static void LiveModeTimerCallback(void* arg) {
        Esp32s3r8n16Uc817642* board = static_cast<Esp32s3r8n16Uc817642*>(arg);
        board->display_->CheckPendingRefresh();
    }

    void HandleNetworkEventCallback(NetworkEvent event, const std::string& data = "") {
        // 注意：不要调用 WifiBoard::OnNetworkEvent，因为会造成递归调用
        // WifiBoard::OnNetworkEvent 已经在调用这个回调之前执行过了
        
        ESP_LOGI(TAG, "[RUNTIME] HandleNetworkEventCallback: event=%d, in_deep_sleep_=%d, wakeup_start_chat_=%d", 
                 (int)event, in_deep_sleep_, wakeup_start_chat_);
        
        switch (event) {
            case NetworkEvent::Connected:
                wifi_connected_ = true;
                display_->showAiChatStatus("IDLE", "WiFi OK");
                ESP_LOGI(TAG, "[RUNTIME] Network connected event received, in_deep_sleep_=%d, wakeup_start_chat_=%d", 
                         in_deep_sleep_, wakeup_start_chat_);
                
                // 关键：只有按键唤醒（wakeup_start_chat_ 为 true 时才启动对话
                if (in_deep_sleep_ && wakeup_start_chat_) {
                    // 按键唤醒：WiFi连接后立即启动对话
                    ESP_LOGI(TAG, "[RUNTIME] Button wakeup, WiFi connected, starting chat NOW");
                    in_deep_sleep_ = false;
                    wakeup_start_chat_ = false;  // 清除标志
                    Application::GetInstance().ToggleChatState();
                } else {
                    // 首次启动或定时器唤醒：先检测电池电量，然后发送心跳和获取图片
                    ESP_LOGI(TAG, "[BATTERY] Reading battery voltage before heartbeat...");
                    UpdateBatteryStatus();
                    ESP_LOGI(TAG, "[HEARTBEAT] WiFi connected, sending heartbeat first...");
                    display_->SendHeartbeat(true);
                    ESP_LOGI(TAG, "[INKSIGHT] Fetching image after heartbeat...");
                    display_->FetchInksightImage();
                }
                break;
            case NetworkEvent::Disconnected:
                wifi_connected_ = false;
                display_->showAiChatStatus("IDLE", "WiFi DISCONNECTED");
                break;
            case NetworkEvent::Connecting:
                display_->showAiChatStatus("CONNECTING", "WS CONNECT");
                break;
            case NetworkEvent::Scanning:
                display_->showAiChatStatus("CONNECTING", "SCANNING...");
                break;
            case NetworkEvent::WifiConfigModeEnter:
                ShowWifiConfigScreen();
                break;
            case NetworkEvent::WifiConfigModeExit:
                break;
            default:
                break;
        }
        
        // 调用保存的回调
        if (saved_network_callback_) {
            saved_network_callback_(event, data);
        }
    }

    void UpdateBatteryStatus() {
        last_battery_voltage_ = ReadBatteryVoltage();
        last_battery_percentage_ = CalculateBatteryPercentage(last_battery_voltage_);

        if (adc_calibrated_) {
            ESP_LOGI(TAG, "Battery status - Voltage: %d mV, Level: %d%%",
                     last_battery_voltage_, last_battery_percentage_);
        }
        
        // 把电池电压传给display
        display_->SetBatteryVoltage(last_battery_voltage_);
    }

    void ScheduleDisplayRefresh() {
        if (wifi_connected_) {
            display_->showAiChatStatus("IDLE", "WiFi OK");
        }
    }

    void CheckAndInitializeInksight(bool is_wake_from_deep_sleep) {
        auto& wifi_manager = WifiManager::GetInstance();
        if (wifi_manager.IsConnected()) {
            ESP_LOGI(TAG, "[INKSIGHT] WiFi already connected, initializing...");
            wifi_connected_ = true;
            
            if (!is_wake_from_deep_sleep) {
                // 首次启动：刷新屏幕，显示 WiFi OK，获取图片
                ESP_LOGI(TAG, "[INKSIGHT] First boot, refreshing screen");
                display_->showAiChatStatus("IDLE", "WiFi OK");
                display_->SendHeartbeat(true);
                display_->FetchInksightImage();
            } else {
                // 唤醒状态：不获取图片，等待对话结束后在 OnDeviceIdle 中获取
                ESP_LOGI(TAG, "[INKSIGHT] Wake from deep sleep, skipping image fetch (will fetch after chat ends)");
                // wakeup_fetch_done_ 已经在 WakeFromDeepSleep() 中设置为 false
                // 对话结束后 OnDeviceIdle() 会检查并获取图片
            }
        } else {
            ESP_LOGI(TAG, "[INKSIGHT] WiFi not connected yet, waiting for event...");
        }
    }

    void InitializeI2c() {
        i2c_master_bus_config_t i2c_bus_cfg = {};
        i2c_bus_cfg.i2c_port = (i2c_port_t)0;
        i2c_bus_cfg.sda_io_num = AUDIO_CODEC_I2C_SDA_PIN;
        i2c_bus_cfg.scl_io_num = AUDIO_CODEC_I2C_SCL_PIN;
        i2c_bus_cfg.clk_source = I2C_CLK_SRC_DEFAULT;
        i2c_bus_cfg.glitch_ignore_cnt = 7;
        i2c_bus_cfg.intr_priority = 0;
        i2c_bus_cfg.trans_queue_depth = 0;
        i2c_bus_cfg.flags.enable_internal_pullup = 1;
        ESP_ERROR_CHECK(i2c_new_master_bus(&i2c_bus_cfg, &i2c_bus_));
    }

